# DataFrame

In [2]:
import pandas as pd

apples = pd.Series([4,2,7])
oranges = pd.Series([4,7,3,])

print(apples, oranges)

0    4
1    2
2    7
dtype: int64 0    4
1    7
2    3
dtype: int64

In [7]:
a = pd.Series([1,2,3,4,5])
obj = pd.Series(['m','t','w','th','f'])
print(a,obj)

0    1
1    2
2    3
3    4
4    5
dtype: int64 0     m
1     t
2     w
3    th
4     f
dtype: object

In [6]:
import pandas as pd

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

#print(apples, oranges)

data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [14]:
a = pd.Series([1,2,3,4,5])
b = pd.Series(['m','tu','w','t','f'])
data = {"d":a,"j":b}
obj_df = pd.DataFrame(data)
print(obj_df)

   d   j
0  1   m
1  2  tu
2  3   w
3  4   t
4  5   f

In [15]:
nice = (["beautiful","famous","gorgeous"])
bad = (["ugly","notorius","unattractive",])
data = {"a":nice,"b":bad}
good_obj = pd.DataFrame(data)
print(good_obj)

           a             b
0  beautiful          ugly
1     famous      notorius
2   gorgeous  unattractive

In [32]:
a = pd.Series([3,2,0,1],["a", "b", "c", "d"])
b= pd.Series([3,2,0,1],  ["mon", "tue", "wed", "thr"])

#print(apples, oranges)
data = {"apples": a, "oranges": b}
fruits_df = pd.DataFrame(data)
print(fruits_df)

     apples  oranges
a       3.0      NaN
b       2.0      NaN
c       0.0      NaN
d       1.0      NaN
mon     NaN      3.0
thr     NaN      1.0
tue     NaN      2.0
wed     NaN      0.0

In [16]:

b_Series = pd.Series(['a','b','x','r'],[1,2,3,4])
a_Series = pd.Series(["mon","tue","wed","th"],[1,2,3,4],)
Data = {"mango":a_Series,"grapes":b_Series}
fruits_df = pd.DataFrame(Data)
print(fruits_df)

  mango grapes
1   mon      a
2   tue      b
3   wed      x
4    th      r

In [20]:
b = pd.Series([1,2,3,4],["jan","feb","mar","dec"])
a = pd.Series([1,2,3,4],["jan","feb","mar","dec"])
data = {"saliha":b,"rimsha":a}
my_df = pd.DataFrame(data)
print(my_df)

     saliha  rimsha
jan       1       1
feb       2       2
mar       3       3
dec       4       4

In [2]:
import pandas as pd
state = ['Ohio', 'Ohio','Ohio','Nevada', 'Nevada', 'Nevada']
data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data 
                     , index = ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'] )
print(df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [3]:
print(df.loc['2nd'])

state    Ohio
year     2001
pop       1.7
Name: 2nd, dtype: object

In [4]:
df.sample()

      state  year  pop
4th  Nevada  2001  2.4

In [5]:
df.sample(3)

      state  year  pop
3rd    Ohio  2002  3.6
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [18]:
df =pd.DataFrame(data, columns=['month', 'week', 'year'])
print(df)

Empty DataFrame
Columns: [month, week, year]
Index: []

In [19]:
obj2 = pd.DataFrame(data,columns=[1,2,3,4], index=['m','t','w','f'])
obj2.head

<bound method NDFrame.head of      1    2    3    4
m  NaN  NaN  NaN  NaN
t  NaN  NaN  NaN  NaN
w  NaN  NaN  NaN  NaN
f  NaN  NaN  NaN  NaN>

In [21]:
obj2 = pd.DataFrame(data,columns=[1,2,3,4], 
                   index=['m','t','w','f'])
obj2
obj2.tail

<bound method NDFrame.tail of      1    2    3    4
m  NaN  NaN  NaN  NaN
t  NaN  NaN  NaN  NaN
w  NaN  NaN  NaN  NaN
f  NaN  NaN  NaN  NaN>

In [31]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six'])
 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

# Displaying Index and Columns Names

In [22]:

print(obj2.columns)

Index([1, 2, 3, 4], dtype='int64')

In [23]:
print(obj2.index)

Index(['m', 't', 'w', 'f'], dtype='object')

In [24]:
obj2[2]

m    NaN
t    NaN
w    NaN
f    NaN
Name: 2, dtype: object

In [33]:

frame2['dept'] = 10

# Deleting data(row or columns From DataFrame)

In [4]:

import numpy as np
import pandas as pd
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)),   
             index=['Ohio', 'Colorado', 'Utah','New Yok,'],
             columns=['one', 'two', 'three','four'])
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New Yok,   12   13     14    15

In [59]:
import numpy as np
import pandas as pd
data_df=pd.DataFrame(np.arange(25).reshape((5,5)),
index=['saliha', 'lala', 'mami', 'mama', 'papa'],
columns=['m','t','w','f','s'])
print(data_df)

         m   t   w   f   s
saliha   0   1   2   3   4
lala     5   6   7   8   9
mami    10  11  12  13  14
mama    15  16  17  18  19
papa    20  21  22  23  24

In [57]:
obj_df=pd.DataFrame(np.arange(4).reshape((2,2)),
                    index=['1','2'],
                    columns=['mon','tue'])
print(obj_df)

   mon  tue
1    0    1
2    2    3

#   Deleting Columns From DataFrame

In [38]:
data_df = data_df.drop('w', axis=1)
print(data_df)

         m   t   f   s
saliha   0   1   3   4
lala     5   6   8   9
mami    10  11  13  14
mama    15  16  18  19
papa    20  21  23  24

In [56]:
obj_df = obj_df.drop("mon",axis=1,)
print(obj_df)

   tue
1    1
2    3

In [53]:
obj_df = obj_df.drop("tue",axis=1,inplace = True)
print(obj_df)

None

# Deleting specific rows From DataFrame

In [58]:
obj_df = obj_df.drop("1",axis=0,)
print(obj_df)

   mon  tue
2    2    3

In [60]:
data_df = data_df.drop("lala")
print(data_df)

         m   t   w   f   s
saliha   0   1   2   3   4
mami    10  11  12  13  14
mama    15  16  17  18  19
papa    20  21  22  23  24

In [61]:
data_df = data_df.drop("mama")
print(data_df)

         m   t   w   f   s
saliha   0   1   2   3   4
mami    10  11  12  13  14
papa    20  21  22  23  24

In [62]:
data_df = data_df.drop("mami")
print(data_df)

         m   t   w   f   s
saliha   0   1   2   3   4
papa    20  21  22  23  24

# Selection with loc and iloc

In [63]:
import numpy as np
import pandas as pd
data_df=pd.DataFrame(np.arange(25).reshape((5,5)),
index=['saliha', 'lala', 'mami', 'mama', 'papa'],
columns=['m','t','w','f','s'])
print(data_df)

         m   t   w   f   s
saliha   0   1   2   3   4
lala     5   6   7   8   9
mami    10  11  12  13  14
mama    15  16  17  18  19
papa    20  21  22  23  24

In [65]:
print( data_df.loc[['lala','mama'], ['m',  't','w'] ] )

       m   t   w
lala   5   6   7
mama  15  16  17

In [66]:
obj_df=pd.DataFrame(np.arange(4).reshape((2,2)),
                    index=['1','2'],
                    columns=['mon','tue'])
print(obj_df)

   mon  tue
1    0    1
2    2    3

In [69]:
print(obj_df.loc[['1'],['mon']])

   mon
1    0

In [70]:
print( data_df.iloc[1:, [3, 0, 1] ] ) # using number instead of labels

       f   m   t
lala   8   5   6
mami  13  10  11
mama  18  15  16
papa  23  20  21

In [71]:
print ( data_df.iloc[ :1 , :4 ] )

        m  t  w  f
saliha  0  1  2  3